// Задание №1 

let cels = prompt('введите значение в цельсиях');
let far = (9 / 5) * cels + 32;

alert(far);





//задание №2  


let name = 'Василий'
let admin = name;
 
alert(admin);


//  задание №3
// Чему будет равно JS-выражение 1000 + "108"/

 console.log(1000+"108") 

//  в данном случае будет равно 1000108, так как 1000-число, а "108"-String





// задание №4 

// атрибут defer сохраняет относительную последовательность скриптов, а async – нет.
//  Кроме того, defer всегда ждёт, пока весь HTML-документ будет готов, а async – нет.
// Из вышеуказанного делаю выввод, что async удобнее и быстрее. 
//изменение -1 